{
  "domains": [
    {
      "domain": "Strategy",
      "building_blocks": [
        {
          "building_block": "Value Case Development",
          "description": "Supports clients in identifying, evaluating, and presenting the potential benefits of an investment or project against associated costs and risks. This involves understanding client business objectives, market dynamics, and competitive landscape, while conducting rigorous financial analysis and ensuring strategic alignment. Key activities include stakeholder management, return on investment modelling, regulatory compliance assessment, and identification of operational efficiency opportunities through managed services. Outputs include robust, data-driven business cases that clearly articulate the value proposition and pathway to success. The goal is to ensure strategic decisions are grounded in sound financial and business rationale, facilitating effective resource allocation and driving sustainable business growth."
        },
        {
          "building_block": "Performance Management, KPIs, Metrics",
          "description": "Supports clients in developing and refining key performance indicators (KPIs) and metrics that align with their specific business goals. This involves assessing current performance measurement approaches, identifying gaps, and designing bespoke frameworks tailored to the client's operational context across multiple business functions. Key activities include KPI design, performance framework development, data analysis, and benchmarking against industry standards. Outputs include customised performance measurement frameworks, dashboards, and data-driven insights that enable informed decision-making. The goal is to help clients measure what matters, drive continuous improvement, and achieve sustainable and measurable business growth."
        },
        {
          "building_block": "Strategy & Op Model",
          "description": "Assists clients in designing and implementing strategies that align with their business goals, and developing operating models that effectively execute those strategies. This involves conducting a comprehensive analysis of the client's industry, market dynamics, internal capabilities, and tax position to outline strategic priorities and identify growth opportunities. Key activities include operating model design, organisational structure optimisation, business process alignment, IT operating model development, and tax strategy integration. Outputs include a clearly defined strategic roadmap, target operating model, and an aligned IT and tax framework that supports the chosen strategic direction. The goal is to create a synergistic relationship between strategy and operations that facilitates sustained business growth, competitive advantage, and efficient tax management."
        },
        {
          "building_block": "Tax Strategy & Integration",
          "description": "Assists clients in developing and implementing effective tax strategies that align with their broader business goals and operating model. This involves understanding the client's specific tax needs, analysing their current tax position, and identifying planning opportunities across domestic and cross-border operations. Key activities include tax structuring, mergers and acquisitions tax advisory, management of cross-border transactions, identification of tax incentives, and integration of tax strategy into the overall business framework. Outputs include customised tax strategies, risk management frameworks, and compliance roadmaps that optimise tax efficiency and minimise liabilities. The goal is to enhance the client's tax position, reduce financial and regulatory risk, and contribute to long-term financial sustainability."
        },
        {
          "building_block": "Deal Design & Integration",
          "description": "Supports clients in structuring, designing, and executing mergers, acquisitions, divestitures, and other strategic transactions to maximise deal value. This involves assessing strategic fit, conducting due diligence, and designing integration or separation plans that align with the client's business objectives. Key activities include deal structuring, synergy identification, integration planning, regulatory and tax consideration, and post-deal value realisation tracking. Outputs include deal design frameworks, integration roadmaps, and governance structures that enable a smooth and effective transaction process. The goal is to help clients navigate the complexity of deals and integrations, minimise risk, and realise the full strategic and financial value of the transaction."
        }
      ]
    },
    {
      "domain": "Business, People & Organization",
      "building_blocks": [
        {
          "building_block": "Value and Benefit Realization",
          "description": "Supports clients in identifying, tracking, and maximising the value and benefits derived from their investments, programmes, and operational activities. This involves aligning business objectives with operational capabilities, establishing benefit ownership, and conducting structured benefits tracking throughout the lifecycle of an initiative. Key activities include benefits mapping, KPI definition, realisation reporting, risk and compliance assessment, and identification of operational efficiency opportunities through managed services. Outputs include benefits realisation frameworks, tracking dashboards, and periodic realisation reports that provide transparency and accountability. The goal is to ensure clients achieve and sustain the full value of their investments while maintaining regulatory compliance and operational efficiency."
        },
        {
          "building_block": "Business Process with Industry Insights",
          "description": "Supports clients in improving their business performance by applying industry-specific insights and process optimisation strategies tailored to their sector. This involves assessing current business processes, understanding the unique challenges and opportunities within the client's industry, and recommending improvements based on leading practices and sector benchmarks. Key activities include process mapping, gap analysis, process redesign, risk management, cybersecurity integration, and regulatory compliance strategy development. Outputs include process improvement roadmaps, redesigned workflows, and industry-specific guidance documents that enhance operational efficiency and customer value. The goal is to help clients optimise their operations, drive innovation, and achieve stronger business performance within the context of their industry."
        },
        {
          "building_block": "Capability Design & Development",
          "description": "Supports clients in assessing, designing, and developing the organisational and technology capabilities required to achieve their strategic objectives. This involves conducting current state capability assessments, identifying gaps, and creating high-level target capability designs that span both business and technology domains. Key activities include capability mapping, gap analysis, capability acquisition strategy, and alignment with the Business Process and Organisational Design building blocks for detailed execution. Outputs include capability frameworks, target state designs, and capability development roadmaps that provide a clear path to building competitive advantage. The goal is to help clients align their organisational capabilities with strategic priorities, foster innovation, and enable agility in a rapidly evolving business environment."
        },
        {
          "building_block": "Business Readiness",
          "description": "Supports organisations in assessing and building their readiness to adopt new strategies, processes, technologies, or regulatory changes prior to implementation. This involves evaluating the organisation's current state, identifying gaps and barriers to change, and developing targeted plans to ensure successful transition and adoption. Key activities include impact assessments, stakeholder analysis, change readiness assessments, communication planning, and coordination with the Change Management, Enablement and Adoption building block. Outputs include readiness assessment reports, gap analyses, and readiness improvement plans that provide a structured pathway to successful change. The goal is to help organisations proactively manage change, minimise resistance, and maximise the likelihood of achieving desired business outcomes."
        },
        {
          "building_block": "Enterprise Resilience",
          "description": "Supports clients in planning for and building a resilient operational and technological environment capable of withstanding large-scale disruptive events. This involves assessing the client's current resilience posture across multiple domains and designing programmes that address vulnerabilities and strengthen organisational durability. Key activities include operational resilience planning, business continuity management, disaster recovery design, cyber resilience assessment, physical security planning, emergency planning, and supply chain resilience analysis. Outputs include enterprise resilience frameworks, business continuity plans, disaster recovery playbooks, and compliance monitoring programmes. The goal is to help clients anticipate, prepare for, respond to, and recover from events that threaten their ability to deliver critical business services."
        },
        {
          "building_block": "Organizational Design",
          "description": "Supports clients in optimising their organisational structures to enhance efficiency, promote collaboration, and align with strategic objectives. This involves assessing the current organisational structure, evaluating the alignment of roles and responsibilities, and designing target state structures that support the delivery of the agreed operating model. Key activities include organisational assessment, design of reporting lines and governance structures, decision-making process redesign, outsourcing consideration, and tax-efficient organisational design. Outputs include organisational charts, governance frameworks, RACI matrices, and design recommendations that provide clarity and accountability across the organisation. The goal is to help clients create agile, adaptable organisations that drive innovation, increase productivity, and enable sustainable growth in a rapidly changing business environment."
        },
        {
          "building_block": "Employee Experience",
          "description": "Supports clients in enhancing the employee experience and fostering a culture of innovation, engagement, and continuous development within their organisations. This involves assessing the current employee experience, identifying areas for improvement, and designing programmes that create a positive, inclusive, and productive work environment. Key activities include employee engagement strategy design, well-being programme development, talent development planning, performance management framework design, and implementation of technology-enabled learning and collaboration tools. Outputs include employee experience strategies, engagement programme designs, talent development frameworks, and innovation initiative roadmaps. The goal is to help clients build an environment where employees feel valued, motivated, and empowered, resulting in increased productivity, improved talent retention, and sustained business success."
        },
        {
          "building_block": "Change Management, Enablement and Adoption",
          "description": "Supports clients in effectively managing organisational change and ensuring that individuals and teams are informed, engaged, and equipped to embrace new ways of working. This involves understanding the drivers and scope of change, identifying potential challenges, and developing comprehensive change management and communications plans. Key activities include change impact assessment, stakeholder engagement strategy, communication planning, resistance management, training programme design, and adoption tracking. Outputs include change management strategies, communication plans, training materials, and adoption metrics dashboards that provide a structured and measurable approach to change. The goal is to help clients navigate the complexities of change, minimise disruption, and achieve successful implementation with high levels of employee adoption and sustained behaviour change."
        },
        {
          "building_block": "Workforce Planning",
          "description": "Supports clients in strategically planning, developing, and upskilling their workforce to meet current and future business needs. This involves assessing the current workforce capabilities, identifying skill gaps, and designing strategies to align talent with the organisation's goals and evolving operating model. Key activities include workforce demand and supply analysis, talent acquisition strategy, succession planning, training curriculum development, and performance management framework design. Outputs include workforce plans, skills gap analyses, talent development roadmaps, and upskilling programme designs that provide a structured approach to building organisational capability. The goal is to help clients build a resilient and adaptable workforce that drives employee engagement, retention, and productivity while fostering a culture of continuous learning and growth."
        },
        {
          "building_block": "GBS - Outsourcing",
          "description": "Supports clients in selecting and transitioning to external service providers for functions identified as suitable for outsourcing following a strategic operating model decision. This involves assessing which services are most appropriate to procure externally, defining service requirements, and managing the provider selection and contracting process. Key activities include outsourcing candidate assessment, market analysis, provider selection, contract design, service level agreement definition, governance framework establishment, and transition management. Outputs include outsourcing strategies, provider shortlists, contracts, SLA frameworks, and transition plans that ensure a smooth and accountable handover of responsibilities. The goal is to help clients achieve cost efficiency, access specialist expertise, and focus internal resources on core strategic activities."
        },
        {
          "building_block": "GBS - Shared Services",
          "description": "Supports clients in establishing and implementing shared services operating models to consolidate and centralise support functions within a captive organisational structure. This involves assessing which functions are suitable for centralisation, defining the scope and operating model of the shared service centre, and managing the transition of responsibilities. Key activities include shared services scoping, process standardisation, location strategy, technology enablement, governance design, change management, and transition planning. Outputs include shared services business cases, operating model designs, process migration plans, and governance frameworks that provide a structured foundation for the shared service centre. The goal is to help clients reduce operational costs, improve service quality and consistency, and free up business units to focus on value-adding activities."
        },
        {
          "building_block": "IT Service Management",
          "description": "Supports clients in designing and optimising their IT service delivery models to align with business objectives, improve operational efficiency, and enhance end-user satisfaction. This involves evaluating the current IT service delivery model, identifying areas for improvement including cybersecurity, and designing a target model that leverages leading frameworks and emerging technologies. Key activities include IT service management framework design, ITIL-aligned process improvement, service catalogue design, service level agreement development, IT governance design, and vendor management optimisation. Outputs include IT service delivery models, governance frameworks, service catalogues, and SLA structures that provide a clear and scalable foundation for IT operations. The goal is to help clients establish a robust and scalable IT service delivery capability that optimises resource allocation, improves service quality, and enables digital transformation."
        }
      ]
    },
    {
      "domain": "Data & AI",
      "building_blocks": [
        {
          "building_block": "Data Privacy & Protection",
          "description": "Supports clients in unlocking the value of their data assets in a secure, ethical, and compliant manner across global operations. This involves assessing the client's current data privacy posture, identifying risks associated with the handling of sensitive information, and designing frameworks that ensure compliance with applicable privacy regulations. Key activities include privacy impact assessments, data classification, consent management design, regulatory compliance analysis (including GDPR and other regional frameworks), and implementation of data protection controls. Outputs include data privacy frameworks, protection policies, compliance roadmaps, and risk registers that provide a structured and auditable approach to data governance. The goal is to help clients protect sensitive information, build trust with customers and regulators, and enable responsible and compliant use of data across the organisation."
        },
        {
          "building_block": "Data & Analytics Strategy and Governance",
          "description": "Supports clients in developing comprehensive data and analytics strategies and implementing effective governance practices that enable data-driven decision-making across the organisation. This involves understanding the client's business objectives, evaluating their data assets and current governance maturity, and designing strategies to harness the full value of data and analytics. Key activities include data governance framework design, data quality management, data integration planning, analytics capability assessment, and compliance with data regulations. Outputs include data and analytics strategies, governance frameworks, data architecture blueprints, and analytics roadmaps that provide a clear and actionable path to data maturity. The goal is to help clients establish a robust and agile data and analytics ecosystem that fosters innovation, improves decision-making, and drives sustainable competitive advantage."
        },
        {
          "building_block": "Master Data Management",
          "description": "Supports clients in establishing a centralised and consistent approach to managing their critical business data across multiple systems and platforms. This involves understanding the client's master data requirements, evaluating their existing data landscape, and designing strategies and processes to ensure accurate, reliable, and up-to-date master data. Key activities include data governance design, data stewardship role definition, data quality assessment, data synchronisation, data consolidation, and cross-platform master data alignment. Outputs include master data management frameworks, data stewardship models, data quality scorecards, and synchronisation architectures that provide a single, trusted view of critical business data. The goal is to help clients improve decision-making, reduce data redundancy and duplication, streamline processes, and enhance overall data quality and operational integrity."
        },
        {
          "building_block": "Business Intelligence & Analytics Consumption",
          "description": "Supports clients in effectively consuming and utilising business intelligence and analytics solutions through the strategic implementation of data technologies and platforms. This involves understanding the client's business objectives, evaluating their existing data and analytics infrastructure, and designing strategies to enhance the accessibility and utilisation of insights. Key activities include analytics tool selection, data integration design, visualisation solution development, data architecture design, governance and compliance assessment, and privacy and security review. Outputs include analytics platforms, data integration solutions, visualisation dashboards, and compliance reporting structures that provide intuitive and reliable access to business insights. The goal is to help clients leverage data effectively to enable seamless access to information, enhance decision-making quality, and improve overall business performance."
        },
        {
          "building_block": "AI/ML Solutions",
          "description": "Supports clients in leveraging artificial intelligence and machine learning technologies to develop innovative solutions that address business challenges and drive measurable outcomes. This involves understanding the client's specific needs, evaluating their data landscape, and designing and implementing AI/ML solutions that are fit for purpose and aligned with strategic goals. Key activities include opportunity identification, data availability and quality assessment, algorithm and model selection, data preprocessing, model development, training, validation, deployment, and integration into existing systems. Outputs include deployed AI/ML models, performance evaluation reports, integration architectures, and AI strategy roadmaps that provide a clear path to intelligent automation and insight generation. The goal is to help clients unlock the value of their data through AI and ML, enabling process automation, data-driven decision-making, enhanced cyber and operational risk management, and sustained competitive advantage."
        },
        {
          "building_block": "Data Engineering & Data Modernization",
          "description": "Supports clients in building modern, scalable data platforms that underpin effective data management and advanced analytics across the enterprise. This involves designing and constructing cloud-based data infrastructure, developing robust data pipelines, and implementing automated data operations that support the full lifecycle of data from collection through to analysis. Key activities include cloud platform design, data pipeline development, scalable storage architecture, data operations automation, and integration with analytics and AI capabilities. Outputs include modern data platforms, data pipeline architectures, cloud infrastructure designs, and operational runbooks that provide a reliable and scalable foundation for enterprise data management. The goal is to help clients modernise their data environment, foster better decision-making, and enable seamless integration with advanced analytics and AI capabilities."
        },
        {
          "building_block": "Data Quality & Conversion",
          "description": "Supports clients in elevating data quality and managing data conversion activities to ensure high data integrity across systems and throughout transformation programmes. This involves comprehensive data profiling, cleansing, and enrichment activities aligned to industry-leading data quality frameworks, as well as managing the transition of data from legacy systems to new platforms. Key activities include data profiling, cleansing, enrichment, audit trail implementation, regulatory compliance assessment, legacy data migration, and ongoing data quality monitoring. Outputs include data quality assessments, cleansed and enriched datasets, conversion plans, audit reports, and data quality scorecards that provide transparency and accountability throughout the data lifecycle. The goal is to ensure that data is accurate, consistent, and fit for purpose at go-live and beyond, supporting both immediate system transitions and long-term data quality standards across the organisation."
        },
        {
          "building_block": "Data Design",
          "description": "Supports clients in developing a strategic and structured approach to managing and leveraging their data assets in alignment with business objectives. This involves assessing current data management practices, understanding business requirements, and designing data architectures, models, and governance frameworks that enable effective use of data across the organisation. Key activities include data requirements definition, data model design, governance framework implementation, data quality optimisation, cybersecurity and risk management integration, and regulatory compliance design. Outputs include data architecture blueprints, data models, governance frameworks, and compliance design documents that provide a clear and actionable foundation for enterprise data management. The goal is to ensure data is effectively structured, governed, and utilised to run business operations, deliver insights, support decision-making, and drive business performance."
        },
        {
          "building_block": "Information Governance",
          "description": "Supports clients in governing their data assets throughout the full data lifecycle, from generation and protection through to disposal, in compliance with applicable regulations and business requirements. This involves understanding the client's data landscape, identifying the most valuable and sensitive data assets, and designing governance frameworks that ensure data is protected, managed, and retired appropriately. Key activities include data lifecycle mapping, regulatory compliance assessment, data classification, risk identification, digital platform enablement, and analytics-driven data discovery. Outputs include information governance frameworks, data lifecycle policies, compliance registers, and risk remediation plans that provide a structured and auditable approach to data stewardship. The goal is to help clients protect their most valuable data, optimise the management of unsecured or unreliable data, and maintain ongoing compliance with relevant data regulations."
        }
      ]
    },
    {
      "domain": "Solution",
      "building_blocks": [
        {
          "building_block": "Business Process & Technology Controls",
          "description": "Supports clients in creating and implementing a robust business and technology control environment that prevents, mitigates, and manages regulatory and operational risks. This involves assessing the current control landscape, identifying control gaps and weaknesses, and designing an integrated control framework that spans both business processes and technology systems. Key activities include control environment assessment, risk identification, control design and implementation, technology control testing, and regulatory compliance alignment. Outputs include control frameworks, risk and control matrices, testing results, and remediation plans that provide a comprehensive and auditable approach to risk and control management. The goal is to help clients establish a resilient control environment that reduces exposure to operational and regulatory risk while supporting business performance and compliance objectives."
        },
        {
          "building_block": "Financial Crimes & Investigations (Internal & External)",
          "description": "Supports clients in preventing, detecting, and investigating financial crimes including fraud, money laundering, and sanctions breaches, while ensuring compliance with applicable regulatory requirements. This involves assessing the client's current financial crime risk posture, designing compliance frameworks, and conducting investigations in support of regulatory, legal, and commercial matters. Key activities include Anti-Money Laundering (AML) programme design, Know Your Customer (KYC) framework implementation, sanctions compliance assessment, financial crime risk assessment, internal and external investigations, and litigation and M&A due diligence support. Outputs include compliance frameworks, investigation reports, due diligence findings, and remediation recommendations that provide clients and their legal counsel with clear and actionable intelligence. The goal is to help clients reduce financial crime risk, meet regulatory obligations, and respond effectively to instances of suspected criminal activity."
        },
        {
          "building_block": "Regulatory Risk & Compliance",
          "description": "Supports clients in navigating their regulatory compliance and risk management obligations by developing a holistic and structured approach to identifying, assessing, and mitigating regulatory requirements. This involves understanding the client's regulatory environment, assessing their current compliance posture, and designing frameworks that embed compliance into business-as-usual operations. Key activities include regulatory landscape analysis, compliance gap assessment, risk identification and prioritisation, compliance framework design, regulatory change management, and readiness programme development. Outputs include regulatory compliance frameworks, risk registers, gap assessment reports, and compliance roadmaps that provide clients with a clear and structured path to regulatory readiness. The goal is to help clients proactively manage regulatory risk, maintain compliance across all applicable jurisdictions, and build a culture of accountability and governance."
        },
        {
          "building_block": "Hardware Product Design",
          "description": "Supports clients in designing and developing physical hardware products from initial concept through to high-yield manufacturing readiness. This involves guiding clients through the full product development lifecycle including market research, product definition, design for excellence (DFX), technology research, and manufacturing qualification. Key activities include industrial design, mechanical and electrical engineering, audio and software engineering, regulatory compliance, prototyping, testing and validation, engineering validation testing (EVT), design validation testing (DVT), and production validation testing (PVT). Outputs include product definitions, design files, validated prototypes, compliance documentation, and manufacturing-ready specifications that provide a complete and manufacturable product design. The goal is to help clients bring innovative, high-quality physical products to market efficiently, with robust manufacturing processes that support high-yield production at scale."
        },
        {
          "building_block": "Identity & Access Management (IAM)",
          "description": "Supports clients in governing and maturing their Identity and Access Management programmes to ensure secure and appropriate access to company data, systems, and equipment. This involves assessing the client's current IAM posture, identifying gaps and vulnerabilities, and designing and implementing solutions across the key IAM domains. Key activities include Identity Governance and Administration (IGA) design, Access Management (AM) implementation, Privileged Access Management (PAM) controls, Customer Identity and Access Management (CIAM) design, and ongoing programme governance. Outputs include IAM frameworks, access policies, governance models, and implementation roadmaps that provide a structured and scalable approach to identity and access control. The goal is to help clients reduce security risk, enforce least-privilege access principles, improve regulatory compliance, and deliver a seamless and secure identity experience for both employees and customers."
        },
        {
          "building_block": "Software Evaluation & Selection",
          "description": "Supports clients in navigating the process of identifying and selecting the right software solution to meet their specific business needs and strategic objectives. This involves assessing the client's current state capabilities, defining future state requirements, and conducting a structured evaluation of available vendor solutions. Key activities include current state assessment, requirements definition, vendor market analysis, evaluation criteria development, demonstration facilitation, scoring and shortlisting, and adoption readiness planning. Outputs include requirements documentation, vendor assessment scorecards, recommendation reports, and selection roadmaps that provide clients with a clear and evidence-based basis for their software investment decision. The goal is to help clients make informed, objective software selection decisions that enhance business performance and support successful long-term adoption."
        },
        {
          "building_block": "Vendor Solution Configuration & Development",
          "description": "Supports clients in implementing and configuring major enterprise software solutions tailored to their specific business requirements and operational context. This involves understanding the client's business processes, selecting the appropriate solution configuration approach, and managing the end-to-end implementation lifecycle. Key activities include solution design, system configuration, data migration, customisation, integration, testing, training, go-live support, and incorporation of risk, regulatory, and tax considerations. Primary solutions supported include Oracle, SAP, Salesforce, Microsoft Dynamics, Workday, Contract Lifecycle Management, Maximo, ESRI, Guidewire, Smart Energy Water, and Coupa. Outputs include configured and tested solutions, data migration plans, integration designs, training materials, and go-live readiness assessments that provide a fully operational and tailored business solution. The goal is to guide clients through the entire implementation journey, ensuring the chosen solution is aligned to their business needs and delivers the desired operational and strategic outcomes."
        },
        {
          "building_block": "Integration",
          "description": "Supports clients in designing, implementing, and executing integration platforms and API solutions that enable seamless connectivity and data flow across systems and applications. This involves understanding the client's integration needs, evaluating available platforms, and providing end-to-end support for successful integration delivery. Key activities include integration strategy and roadmap development, platform selection and configuration, data mapping and transformation, API development and management, integration testing, and cybersecurity and compliance integration. Primary platforms supported include MuleSoft and Boomi. Outputs include integration architectures, API catalogues, platform configurations, and testing results that provide a reliable and scalable integration foundation. The goal is to help clients achieve seamless interoperability between their systems, reduce data silos, and enable efficient and secure data exchange across the enterprise."
        },
        {
          "building_block": "Solution Architecture",
          "description": "Supports clients in designing optimal solution architectures for their technology initiatives that are scalable, secure, and aligned with business objectives. This involves understanding the client's requirements and technology landscape, evaluating options, and providing expert guidance on architecture design across both enterprise and solution levels. Key activities include enterprise architecture strategy, business architecture design, application architecture, data architecture, cloud architecture, DevOps architecture, process architecture, cyber risk management integration, and regulatory compliance consideration. Outputs include architecture blueprints, solution design documents, architecture decision records, and compliance frameworks that provide a clear and actionable technical foundation for delivery. The goal is to help clients design technology solutions that are robust, future-proof, and well-aligned to their strategic direction, while managing risk and ensuring regulatory compliance."
        },
        {
          "building_block": "User Experience",
          "description": "Supports clients in designing products and services that deliver seamless, intuitive, and engaging experiences for their users. This involves understanding the client's target audience, conducting user research, and applying human-centred design principles to inform the design of interfaces and interactions. Key activities include user research, usability testing, persona development, journey mapping, wireframing, prototyping, and iterative design validation. Outputs include user research findings, journey maps, wireframes, interactive prototypes, and UX design specifications that provide a clear and validated blueprint for interface development. The goal is to help clients create products and services that meet user needs, drive customer satisfaction and loyalty, and deliver measurable improvements in engagement and business performance."
        },
        {
          "building_block": "Cloud & Infrastructure Engineering",
          "description": "Supports clients in designing, implementing, and optimising their infrastructure and cloud environments to provide a secure, scalable, and resilient foundation for their technology operations. This involves assessing the client's current infrastructure landscape, identifying areas for improvement, and designing target state environments that meet business and technical requirements. Key activities include network architecture design, server and storage infrastructure design, cloud platform selection and configuration, infrastructure security design, performance optimisation, and ongoing infrastructure management. Outputs include infrastructure designs, cloud architecture blueprints, implementation plans, and operational runbooks that provide a robust and well-documented foundation for technology operations. The goal is to help clients establish a modern, efficient, and secure infrastructure environment that supports business agility, reduces operational risk, and enables digital transformation."
        },
        {
          "building_block": "Cloud Migration & Optimization",
          "description": "Supports clients in planning and executing successful migrations to cloud environments and optimising their existing cloud deployments to maximise value and efficiency. This involves assessing the client's current application and infrastructure estate, defining a cloud migration strategy, and managing the end-to-end migration process using leading cloud technologies and best practices. Key activities include cloud readiness assessment, migration strategy development, workload prioritisation, migration execution, post-migration optimisation, cost management, and security and compliance validation. Outputs include cloud migration strategies, workload migration plans, optimisation recommendations, and post-migration performance reports that provide a clear and structured path to cloud adoption. The goal is to help clients realise the full benefits of cloud computing including improved agility, reduced infrastructure costs, enhanced resilience, and accelerated innovation."
        },
        {
          "building_block": "Custom Application Development",
          "description": "Supports clients in designing, building, and deploying robust and scalable software applications tailored to their specific business needs and objectives. This involves managing the full application development lifecycle from requirements gathering through to deployment and ongoing support. Key activities include requirements gathering and analysis, product management, UX design, solution architecture, coding and development, testing and quality assurance, deployment and release management, and R&D tax credit eligibility assessment. Outputs include fully developed and tested applications, technical documentation, deployment packages, and support frameworks that provide clients with reliable and fit-for-purpose software solutions. The goal is to help clients deliver high-quality custom software that solves specific business problems, drives operational efficiency, promotes innovation, and where applicable, leverages available R&D tax incentives."
        },
        {
          "building_block": "Performance Optimization & SRE",
          "description": "Supports clients in improving the performance, stability, and scalability of their software applications and systems through the application of performance engineering and site reliability engineering (SRE) practices. This involves assessing current system performance, identifying bottlenecks and reliability risks, and implementing targeted optimisation and reliability improvements. Key activities include performance profiling and benchmarking, bottleneck identification, optimisation implementation, SRE framework design, incident management, reliability monitoring, and ongoing SRE operational support. Outputs include performance assessment reports, optimisation recommendations, SRE frameworks, monitoring dashboards, and incident response playbooks that provide a structured and measurable approach to system reliability. The goal is to help clients achieve high-performing, resilient, and scalable systems that meet user expectations, reduce downtime, and support the reliable delivery of business-critical services."
        },
        {
          "building_block": "Security Integration",
          "description": "Supports clients in embedding security controls into their enterprise applications and identity solutions to protect assets, maintain data confidentiality, ensure integrity, and meet compliance requirements. This involves assessing the current security posture of application and identity environments, identifying vulnerabilities and compliance gaps, and designing and implementing integrated security solutions. Key activities include security architecture design, application security controls implementation, identity solution security integration, compliance framework alignment, vulnerability assessment, and security testing. Outputs include security architecture designs, integrated security controls, compliance evidence packages, and remediation plans that provide a structured and verifiable approach to application and identity security. The goal is to help clients build a security-by-design culture across their application landscape, reducing the risk of data breaches, ensuring regulatory compliance, and maintaining the trust of customers and stakeholders."
        },
        {
          "building_block": "Cyber Security",
          "description": "Supports clients in protecting their digital assets, systems, and data from the full spectrum of cyber threats through a comprehensive and proactive approach to cybersecurity. This involves assessing the client's current cyber risk posture, identifying vulnerabilities and threat vectors, and designing and implementing security measures that ensure the confidentiality, integrity, and availability of information assets. Key activities include cyber risk assessment, threat intelligence analysis, security architecture design, penetration testing, incident response planning, malware and ransomware protection, phishing mitigation, and ongoing security monitoring and support. Outputs include cyber risk assessments, security architectures, incident response playbooks, vulnerability reports, and security monitoring frameworks that provide a robust and comprehensive defence against cyber threats. The goal is to help clients reduce their cyber risk exposure, respond effectively to incidents, and build a resilient and compliant security posture that protects the organisation and its stakeholders."
        }
      ]
    },
    {
      "domain": "Operations",
      "building_blocks": [
        {
          "building_block": "Internal Audit & Monitoring of Internal Controls",
          "description": "Supports clients in obtaining an independent and objective assessment of their processes, systems, data, and financial statements to identify and mitigate applicable risks. This involves planning and executing audit activities across a range of risk domains including financial reporting, cybersecurity, and operational risk, and providing actionable recommendations for improvement. Key activities include audit planning, risk-based scoping, process and control testing, financial statement review, cybersecurity audit, operational risk assessment, and findings reporting. Outputs include internal audit reports, control testing results, risk registers, and management action plans that provide clients with a clear and evidence-based view of their control environment. The goal is to help clients strengthen their internal control frameworks, improve governance and accountability, and reduce exposure to financial, operational, and regulatory risk."
        },
        {
          "building_block": "Operational Engineering (incl. Quality Engineering)",
          "description": "Supports clients in enhancing product quality and customer satisfaction through scalable, efficient, and expert-led operational and quality engineering capabilities. This involves assessing current quality practices, implementing advanced quality engineering techniques, and flexibly scaling quality engineering capacity to meet changing business demands. Key activities include quality framework design, quality assurance process implementation, quality control testing, performance benchmarking, defect management, and capacity planning for quality engineering resources. Outputs include quality engineering frameworks, test plans, quality assessment reports, defect logs, and performance benchmarks that provide clients with a structured and measurable approach to quality management. The goal is to help clients consistently deliver high-quality software and products, reduce defect rates, improve customer satisfaction, and optimise the efficiency of their quality engineering operations."
        },
        {
          "building_block": "Technology Managed Service",
          "description": "Supports clients in maintaining the ongoing availability, performance, and functionality of their enterprise business applications through expert-led managed service operations. This involves providing routine maintenance, updates, troubleshooting, and system optimisation services for major platforms including Oracle, SAP, Workday, Salesforce, Guidewire, Atlassian, and ServiceNow. Key activities include application maintenance, incident management, system updates and patching, performance monitoring, user support, and continuous improvement of application operations. Outputs include service performance reports, incident logs, system health dashboards, and improvement recommendations that provide clients with full visibility of their application landscape. The goal is to help clients offload application support and maintenance responsibilities, ensuring reliable and responsive technology operations that free internal teams to focus on core business activities."
        },
        {
          "building_block": "Risk & Regulatory Managed Services",
          "description": "Supports clients in managing risk and regulatory obligations through specialist managed services that combine operational expertise, strategic thinking, and advanced technology solutions. This involves designing and operating efficient workflows that address the risk and regulatory components of client operations, including process automation, data management, and customer support functions. Key activities include regulatory process management, risk monitoring, compliance reporting, workflow automation, data management, and operational performance tracking. Outputs include managed service performance reports, compliance dashboards, process automation solutions, and risk and regulatory status updates that provide clients with ongoing assurance and operational efficiency. The goal is to help clients reduce the cost and complexity of managing risk and regulatory obligations while maintaining high standards of compliance, accuracy, and operational performance."
        },
        {
          "building_block": "Business Outcome Managed Services (BOMS)",
          "description": "Supports clients in managing their legal, finance, and accounting operations through outcome-focused managed services that drive efficiency, reduce costs, and enhance productivity. This involves combining operational expertise, strategic thinking, and advanced technology solutions to deliver efficient and reliable support for business-critical functions. Key activities include legal operations support, finance and accounting process management, workflow automation, data management, process optimisation, and customer support operations. Outputs include managed service performance reports, process efficiency metrics, automation solutions, and operational improvement recommendations that provide clients with a clear view of outcomes delivered. The goal is to help clients achieve better business outcomes from their legal, finance, and accounting functions by leveraging specialist expertise and technology-enabled operations at scale."
        }
      ]
    },
    {
      "domain": "Enablement",
      "building_blocks": [
        {
          "building_block": "DevSecOps",
          "description": "Supports clients in adopting a unified and integrated approach to software development, security, and operations that accelerates delivery while maintaining consistent security and operational standards. This involves assessing the client's current development and operations practices, identifying security and efficiency gaps, and designing and implementing a DevSecOps framework that embeds security throughout the delivery pipeline. Key activities include DevOps toolchain selection and configuration, security protocol automation, pipeline design, vulnerability management, release velocity optimisation, and security integration at the earliest stages of development. Outputs include DevSecOps frameworks, automated pipeline configurations, security assessment reports, and toolchain architectures that provide a secure, efficient, and repeatable path from development to deployment. The goal is to help clients reduce security vulnerabilities, accelerate release cycles, and maintain the agility and innovation speed required to remain competitive."
        },
        {
          "building_block": "Program Management",
          "description": "Supports clients in planning, executing, and governing strategic programmes and projects through expert programme management and agile coaching capabilities. This involves providing leadership and guidance across both traditional project management methodologies and agile practices to ensure initiatives are delivered within scope, on time, and within budget. Key activities include programme planning, project governance, scope and schedule management, budget tracking, agile team formation, scrum facilitation, agile coaching, impediment resolution, and continuous improvement facilitation. Outputs include programme plans, governance frameworks, status reports, agile delivery artefacts, and coaching assessments that provide clients with clear visibility and control over their strategic initiatives. The goal is to help clients deliver their programmes successfully, foster a culture of continuous improvement and adaptability, and build internal delivery capability that sustains long-term organisational performance."
        },
        {
          "building_block": "Deployment & Deployment Support",
          "description": "Supports clients in ensuring a smooth, controlled, and reliable transition from development to production for business and cloud solutions. This involves providing expertise in both manual and automated deployment methodologies and delivering post-deployment support to ensure stability, performance, and user adoption following release. Key activities include deployment strategy design, release management, automated and manual deployment execution, infrastructure configuration, post-deployment troubleshooting, performance monitoring, and user training. Outputs include deployment plans, release packages, post-deployment monitoring dashboards, and support documentation that provide clients with a structured and well-governed approach to solution release. The goal is to help clients minimise deployment risk and disruption, maximise system stability and performance, and ensure that newly deployed solutions are fully adopted and delivering value as quickly as possible."
        },
        {
          "building_block": "Quality Management",
          "description": "Supports clients and delivery teams in embedding a systematic and structured approach to quality across all phases of a project or programme to increase the likelihood of success and reduce quality-related risks. This involves designing and implementing quality management activities that are tailored to the specific context of the engagement and aligned with PwC's governance and delivery standards. Key activities include quality planning, quality assurance, quality control, quality review facilitation, Quality Partner or Quality Review Partner (QRP) engagement, and quality reporting at delivery, territory, and network levels. Outputs include quality management plans, assurance review reports, control testing results, and quality performance dashboards that provide a comprehensive and layered view of quality across the programme. The goal is to help clients and delivery teams consistently deliver high-quality outcomes for the Firm, clients, and people, while proactively managing quality risks that could otherwise prevent the realisation of planned programme benefits."
        }
      ]
    }
  ]
}